[
    {
        "id": "1",
        "title": "Кто такой программист?",
        "img": "https://dit.urfu.ru/fileadmin/user_upload/site_15560/blog/programmer1.jpg",
        "desc": "Программист — это специалист по разработке компьютерных программ. Под разработкой понимается продумывание архитектуры программы, её реализация, оптимизация и тестирование. Далее мы разберёмся, как стать настоящим айтишником и что для этого нужно знать."
    },

    {
        "id": "2",
        "title": "Каким был мой путь программиста, и как я попал в Хекслет",
        "img": "https://cdn2.hexlet.io/assets/blog_promo-1dd16bc28d9a4aed4b07019a7934d27c258d6cf8ca53f803634fc38d1d406c57.png",
        "desc": "Меня зовут Александр, я начальник IT-отдела одного из птицеводческих предприятий Подмосковья. Мой путь в программировании начался в далеком 1994 году, когда меня, 14-летнего парнишку, отвели на частные курсы по информатике. Помню, с каким восторгом я тогда впервые смотрел на компьютер. На первых уроках учительница рассказала мне о языке программирования Basic, и я влюбился в программирование с первого кода :) Далее у меня были уроки информатики в школе, где я с упоением кодил на компьютерах «Электроника» с картриджами над клавиатурой. Программы на них еще улетали в небытие после выключения компьютера, так как дисков или даже дискет в этих приборах не было. Чуть позже я записался на бесплатные уроки Хекслета, чтобы прочувствовать его подход к обучению. И хотя информация по Python, которую я сейчас прохожу, для меня не новая, но подача материала, суть, выжимка информации, отсутствие воды и качественный тренажер кода подкупили меня с первого урока. Даже балльная и рейтинговая система чем-то привлекает: хочется расти и делать успехи. Надеюсь, что мое знакомство с Хекслетом даст мне прочный фундамент и опору в обучении программированию."
    },

    {
        "id": "3",
        "title": "История CS:GO",
        "img": "https://киберспорт.рф/wp-content/uploads/2017/05/1.jpg",
        "desc": "Первые новости о разработке игры появились вместе с официальным анонсом — 12 августа 2011 года. Слухи о том, что компания Valve, ответственная за серию игр Counter-Strike, разрабатывает новую часть игры (последней на тот момент основной игрой серии, не считая отдельной версии, направленной на азиатскую аудиторию, была Counter-Strike: Source 2004 года) распространились несколькими днями ранее. Также с момента релиза игры, был открыт официальный магазин, где можно приобрести коллекционные предметы по мотивам игры, например реальную версию «Five Year Veteran Coin». При этом с Valve сотрудничают такие компании как SteelSeries для содействия в продвижении игровых манипуляторов, а также гарнитур и ковриков для мыши."
    },

    {
        "id": "4",
        "title": "Плюсы и минусы стать программистом",
        "img": "https://4brain.ru/blog/wp-content/uploads/2021/05/professija-programmist-koder-ili-sozdatel.png",
        "desc": "IT-компании предлагают опытным программистам высокие зарплаты, карьерный рост и возможность выбора локации, оборудование и девайсы для рабочего процесса. Привлекательным фактором для многих сотрудников выступает удалённый или гибридный формат работы. Взамен программисту нужно уметь адаптироваться к быстро меняющейся среде, запросам рынка и потребностям заказчика."
    },

    {
        "id": "5",
        "title": "История Dota 2",
        "img": "https://wewatch.gg/ru/blog/wp-content/uploads/2020/05/roshan-dota-2-guide-1024x576-1.jpg",
        "desc": "DotA – глубокая и даже бездонная игра, которая затягивает с головой. Потому-то фанаты этой игры тратят на неё всё свободное время. Всевозможными гайдами, подсказками и советами мастеров по Доте завален весь интернет. Но вся эта информация, опять же, только для фанатов. Всем прочим игрокам больше интересны не внутренние тонкости игры, а история её феноменального успеха. Из простенькой, но необычной модификации она доросла до титула самой популярной киберспортивной дисциплины в мире. Очень необычный случай, который так и притягивает к себе внимание. Как минимум, это должно быть интересно разработчикам, желающим повторить хотя бы часть этого успеха. И пока турниры по Доте (The International) являются самыми крупнобюджетными соревнованиями в киберспорте (таблица бюждетов киберсоревнований). «LoL» берёт своей популярностью среди простых игроков, а «DotA 2» продолжает привлекать самых именитых киберспортсменов."
    },

    {
        "id": "6",
        "title": "Сборная Казахстан по футболу",
        "img": "https://kff.kz/uploads/images/2022/10/06/633eaa2ab2671.jpg",
        "desc": "Сбо́рная Казахста́на по футбо́лу — команда, представляющая Казахстан на международных соревнованиях по футболу. Управляющая организация — Казахстанская федерация футбола. Федерация футбола Казахстана является членом ФИФА с 1994 года, УЕФА — с 2002 года."
    },

    {
        "id": "7",
        "title": "Доллар еще немного подешевел на торгах 12 октября",
        "img": "https://zakon-img1.object.pscloud.io/53eddcdd0f6d4d3eb91171c1aacf79b8.jpeg",
        "desc": "По данным Казахстанской фондовой биржи (KASE), по состоянию на 15:30 средневзвешенный курс доллара составил 475,78 тенге, снизившись на 1 тенге, сообщает Zakon.kz."
    },

    {
        "id": "8",
        "title": "Как стать разработчиком игр?",
        "img": "https://delai-vibor.com/wp-content/uploads/2023/05/Razrabotchik-igr.jpg",
        "desc": "Что нужно знать программисту, чтобы войти в геймдев? Сперва необходимо определиться, как устроены игры. Хороший вариант для начинающих — готовые движки, такие как Unity и Unreal Engine (но последний сложнее и серьёзнее). Далее стоит определиться с платформой, под которую вы хотите разрабатывать игры. Поэтому на вопрос, что нужно знать разработчику игр, ответить не так просто."
    },

    {
        "id": "9",
        "title": "В Германии за убийство в 1974 году будут судить бывшего сотрудника Штази",
        "img": "https://gdb.rferl.org/8fcc4441-488f-40d5-bd71-931873dc3d29_w1023_r1_s.jpg",
        "desc": "Прокуратура земли Берлин выдвинула обвинение в убийстве, совершённом коварным способом, против 79-летнего жителя германской столицы. В 1974 году бывший сотрудник Штази (Министерства госбезопасности ГДР) выстрелом в спину убил гражданина Польши, который пытался перейти границу между столицей ГДР и Западным Берлином."
    },

    {
        "id": "10",
        "title": "МОК отстранил Олимпийский комитет России из-за его отделений в оккупированных регионах Украины",
        "img": "https://ichef.bbci.co.uk/news/800/cpsprodpb/2137/live/b56dfb10-6909-11ee-a2d1-7d03bb88cfad.jpg",
        "desc": "Международный олимпийский комитет (МОК) объявил об отстранении Олимпийского комитета России (ОКР) до дальнейшего уведомления. Причиной такого решения стало включение в состав ОКР олимпийских советов «ДНР», «ЛНР», а также Херсонской и Запорожской областей — оккупированных территорий Украины, которые Россия называет своими «новыми регионами»."
    }
]
